package com.example.jerusalemiugtwo

import android.annotation.SuppressLint
import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.view.WindowManager
import kotlinx.android.synthetic.main.activity_info.*

class InfoActivity : AppCompatActivity() {

    var  title : String? = ""
    var  image : Int? = null

    override fun onCreate(savedInstanceState: Bundle?) {
        window.setFlags(
            WindowManager.LayoutParams.FLAG_FULLSCREEN,
            WindowManager.LayoutParams.FLAG_FULLSCREEN
        )
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_info)

        back_but.setOnClickListener {
            finish()
        }
        if (intent != null){
            val intent : Intent = intent
            if (intent.hasExtra("title")){
                title = intent.getStringExtra("title")
                title_info_activity.text = title
                getContent()
            }
            if (intent.hasExtra("image")){
                image = intent.getIntExtra("image" , -1)
                image_info_activity.setImageResource(image!!)
            }
        }

    }


    @SuppressLint("SetTextI18n")
    private fun getContent() {
        if (title.equals("أجر الصلاة في المسجد الاقصى")){
            content_info.text = "ورد في فضل الصلاة في المسجد الأقصى المبارك عدة أحاديث ولا تعارض بينها فقد ورد ب (100)صلاة وفي حديث آخر (500)صلاة وفي حديث آخر ب (250) صلاة وللتوفيق بين الاحاديث نوضح راي العلماء فيما يلي لبيان فضل الصلاة في المسجد الأقصى ومضاعفتها.\n" +
                    "\n" +
                    "3-فعن أبي ذر رضي الله عنه قال: تذاكرنا ونحن عند رسول الله صلى الله عليه وسلم أيهما أفضل مسجد رسول الله صلى الله عليه وسلم أو مسجد بيت المقدس؟ فقال رسول الله صلى الله عليه وسلم: ((صلاة في مسجدي هذا أفضل من أربع صلوات فيه، ولنعم المصلى، وليوشكن ألا يكون للرجل مثل شطن فرسه من الأرض حيث يرى منه بيت المقدس خير له من الدنيا جميعاً أو قال خير من الدنيا وما فيها)).\n" +
                    "رواه الطحاوي في مشكل الآثار (1 / 248) والبيهقي في الشعب (3 / 486 / 4145). والحاكم في المستدرك (8/148 برقم 8230): الطبراني في معجمه الأوسط (7/103 برقم 6983): وقال: هذا حديث صحيح الإسناد ولم يخرجاه، ووافقه الذهبي.\n" +
                    "من فوائد هذا الحديث:\n" +
                    "قول النبي صلى الله عليه وآله وسلم \"ولنعم المصلى هو\" في الحديث فيه دلالات كثيرة، منها:\n" +
                    "1-هذا الحديث من أعلام النبوة لأن فيه البشارة بفتح بيت المقدس قبل أن يفتح.\n" +
                    "2-اهتمام الصحابة رضوان الله عليهم بالسؤال عن المسجد الأقصى المبارك  وأجر الصلاة فيه.\n" +
                    "3-الحديث فيه دلالة بالغة على مكانة المسجد الأقصى المبارك في نفوس المسلمين، مكانته العظيمة في الشرع.\n" +
                    "4-فيه ثناء النبي صلى الله عليه وآله وسلم على المسجد الأقصى المبارك.\n" +
                    "5-فيه أجر الصلاة في المسجد الأقصى المبارك تعدل 250 صلاة فيما سواه.\n" +
                    "6-فيه دلالة واضحة على أن قضية المسجد الأقصى المبارك ستبقى حية في نفوس أبناء هذا الدين لا يزعزعها إنكار الأعداء وافتراءات المعتدين.\n" +
                    "7-وفيه إشارة إلى عظم المسؤولية الموكولة على أهل القدس.\n" +
                    "8-وفيه لفتة مهمة إلى أنه قد يأتي زمان لا يستطيع أحد من المسلمين الإقامة حول المسجد الأقصى.\n" +
                    "9-أن نسخ القبلة الأولى – المسجد الأقصى المبارك – لم يلغ منزلتها الشرعية في الإسلام، ولم يُجعل كغيره من المساجد، بل بقيت منزلته محفوظة.\n" +
                    "10- أن قضية المسجد الأقصى المبارك وبيت المقدس لا تنفصل أبداً عن قضية الإسلام الكبرى.\n" +
                    "وها نحن نعيش في زمن نلمس فيه صدق ما أخبر به النبي صلى الله عليه وآله وسلم مما سيكون عليه وضع المسجد الأقصى في ظل الاحتلال اليهودي الحاقد، بل ما عليه الان من خلال ممارساته اليومية بكل الطرق لتفريغ بيت المقدس من المسلمين وتهجيرهم والتضييق عليهم، ومن أبرز هذه الممارسات:\n" +
                    "1-الأطواق المتمثلة بالمغتصبات حول الأقصى والقدس بأكملها بأطواق خانقة.\n" +
                    "2-غلاء الأراضي وارتفاع أسعارها حول الأقصى تحديداً وفي بقية القدس وخصوصاً البلدة القديمة.\n" +
                    "3-الحصار الاقتصادي على المسلمين في القدس، وقطع الصلات الاجتماعية معهم.\n" +
                    "4-الطوق الأمني حول القدس وبداخلها الذي يضيق على المسلمين فيها من كل الجوانب (دينياً واقتصادياً واجتماعياً) ويقطع أواصر الاتصال فيها، وفي المقابل يعطي صلاحيات كبيرة للمغتصبين اليهود للإقامة فيها.\n" +
                    "5-الطرد المبرمج لأهالي القدس عبر سن سلسلة من القوانين الجائرة.\n" +
                    "6-الأخطار المتواصلة لكل من يسكن ويقيم في القدس من المسلمين، وذلك بالاعتداء عليهم والتضييق عليهم والأذى الجسماني الذي قد يصل للقتل.\n" +
                    "7- التهويد المستمر لشوارعها وأحيائها، بل وصل الأمر حتى إلى مقابرها!! كما يحدث لمقبرة \"مأمن الله\" في القدس والتي تحوي على قبور كثير من الصحابة والصالحين وغيرهم، إضافة لغيرها من المقابر حول أسوار المسجد الأقصى المبارك.\n"
        }else if (title.equals("مكانة القدس في الاسلام")) {
            content_info.text = "حملت مدينة القدس أهم الصفات والألقاب في تاريخ المدن الإسلامية، وتعززت مكانتها في العقيدة الإسلامية؛ فهي أولى القبلتين، وثالث الحرمين الشريفين، وقد أُطلق على قبة الصخرة المشرفة والمسجد القبلي الذي فيه المحراب اسم المسجد الأقصى، كما ورد في القرآن الكريم في سورة الإسراء. ولم يطلق على المسجد الأقصى اسماً منفصلاً إلا في أواخر العهد الأموي، فتمت تسميته مسجد بيت المقدس، كما أطلق عليه الرحالة الإيراني ناصر خسرو مسجد بيت المقدس، ويعد ابن فضل الله العمري أول من أستعمل لفظ الحرم القدسي الشريف ليضم قبة الصخرة المشرفة والمسجد الأقصى، والمنشآت الدينية الأخرى الكائنة في ساحاته.تظهر أهمية القدس، ومكانتها في العهد الراشدي عام 637م، بموافقة الخليفة عمر بن الخطاب على طلب بطريرك القدس، فدخلها وكتب لنصارى المدينة «العهدة العمرية»، لتجسد فكرا إنسانيا وحضاريا متقدما، فهي نموذج من العقود التي وثقها المسلمون مع أصحاب الديانات الأخرى، وفي المدينة أرست العهدة العمرية قواعد التسامح واحترام العهود. ومع مجيء بني أمية للحكم (660-750م)، نال بيت المقدس اهتماماً خاصاً لأسباب سياسية ودينية فشاد الأمويون في المدينة صروحاً عظيمة، ليؤكدوا حرمة الحرم، وليكسبوا الاحترام والشهرة بين المسلمين، حيث أقدم الخليفة عبدالملك بن مروان على بناء قبة الصخرة المشرفة فيما بين (69-72هـ)، وقد ساهم بعض أهل القدس كـرجاء بن حيوة الكندي، ويزيد بن سلام في بناء القبة التي تمتاز بتصميمها الفريد كأقدم أثر إسلامي لازال قائماً. أما في العهد الفاطمي فقد رمم الخليفة المستنصر الواجهة الأمامية للمسجد الأقصى، وفي سنة 1022م، أعاد الخليفة الظاهر ترميم المسجد الأقصى، وأسوار المدينة بعد أن كانت قد تضررت، وأنشأ الفاطميون في مدينة القدس البيمارستان ودار العلم، وتشير الأعمال المتقنة التي قام بها الفاطميون إلى أنهم لم يكونوا أقل حرصاً ممن سبقهم من الحكام على تأكيد حرمة بيت المقدس."
        }else if (title.equals("قصة المسجد الاقصى عبر العصور")) {
            content_info.text = "ارتبط تاريخ بيت المقدس (المسجد الأقصى المبارك وما حوله) دوما بالصراع بين الحق والباطل. فهو صراع عقدي، في قديمه وحديثه ومعاصره، ولم يكن أبدا مجرد صراع عرقي أو حتى ديني. لقد ارتبطت هذه المنطقة المباركة بالأنبياء وبمنهج الله تعالى الذي حملوه إلى البشر، ومتى صحّ الناس، أيا كان جنسهم، أو شرعهم، أو ديانتهم، على هذا المنهج، نعمت المنطقة، والعالم معها، بالأمن والإيمان والسلامة والإسلام، ونعم المسجد الأقصى المبارك بالعمران. ومتى انحرف الناس عن منهج الأنبياء وهداهم، فقدت المنطقة أمنها وسلامها، وتعرض المسجد المبارك للإهمال، بل وللتدمير، في بعض الأحيان.\n" +
                    "\n" +
                    "لم يرتبط تاريخ المسجد الأقصى المبارك والأرض المقدسة كلها، صعودا وهبوطا، بغلبة عنصر عرقي على آخر، سواء كانوا من نسل الأنبياء أو لم يكونوا كذلك. لقد حكمه بنو إسرائيل تارة بالعدل، وكان هذا في فترة إيمانهم واتباعهم لمنهج الله الذي حمله أنبياؤهم، كما حكموه تارة أخرى بالظلم، عندما حادوا عن هدي الله. وكذلك شهدت عصور العرب فيه صعودا وهبوطا، بداية من هجرة الكنعانيين العرب إلى المنطقة في العصور التاريخية الأولى، وحتى الفتح العربي الإسلامي لها في العصور الأخيرة، وكان ذلك أيضا تبعا لمستوى إيمانهم واتباعهم لهدي الأنبياء.\n" +
                    "\n" +
                    "وكذلك لم يرتبط تاريخ الأرض المباركة بسيادة أتباع إحدى الديانات أو الشرائع التوحيدية التي عرفتها المنطقة، بل لقد ظل المحك هو الوفاء بالعهد مع الله تعالى. وهذا العهد إنما يرتبط بصحة العقيدة، وسلامة التوحيد، والاستقامة على الشريعة التي ارتضاها الله تعالى لعباده وحملها الأنبياء، أيا كانت شخوص هؤلاء الأنبياء أو عرقياتهم. لقد ظلم أتباع موسى وعيسى عليهما الصلاة والسلام أنفسهم، فكتموا ما أنزل الله، وأفسدوا في الأرض المباركة، بعد صلاح، فسلط الله عليهم الكافرين من البابليين والرومان. وبالمثل، فقدت الأرض المباركة استقرارها، فاحتلها الصليبيون، ومن بعدهم الصهاينة، عندما ضعفت العقيدة في نفوس أتباع محمد عليه الصلاة والسلام، وعندما خالفوا العهد مع الله.\n" +
                    "\n" +
                    "إنه عهد الله تعالى مع هذه الأرض المباركة، ومع المؤمنين به تعالى في كل عصر، هو عهد التمكين، وعهد الوراثة. وهو عهد متحقق دوما ما دام المؤمنون أيضا على عهدهم مع الله. فإذا صدقوا ما عاهدوا الله عليه، أنجز تعالى وعده لهم، وأورثهم إياها، وإن أخلفوا العهد، لم تعد حقا لهم.\n" +
                    "\n" +
                    "وهذا العهد بالوراثة لا يعني إرث ملك يستحل به أتباع الرسل نزع ما يملكه الآخرون في هذه الأرض المباركة، أو اغتصاب حقوقهم. وإنما هو إرث إمامة، وإرث قوامة على الناس يمنحه الله تعالى لمن يستقيم على منهجه، أيا كان عرقه أو اسمه أو النبي الذي يتبعه. وهدف هذا التمكين هو إتاحة الفرصة لهؤلاء الأتباع الحقيقيين المستقيمين على منهج الله لإرساء العدل والحق في الأرض كلها، ورفع الظلم عن الناس جميعا، مؤمنهم وكافرهم.\n" +
                    "\n" +
                    "ولا شك أن دور هذا البعد العقيدي للصراع في ازدهار المسجد والمدينة والمنطقة كلها أو انحدارها بارز. فبالأمس القريب، عندما حكمها أصحاب العقيدة الصحيحة، والمنهج القويم، عاش الجميع، من كافة الأجناس والديانات، بأمان وسلام وازدهار، لفترة لم تكن بالقصيرة. أما اليوم، فإن المشاهَد في هذه الأرض المباركة هو العدوان، والفساد، والتدمير، وانتشار جرائم الرشوة ومختلف الرذائل والموبقات، واستحلال حرمات الأنبياء والمقدسات، وذلك من جانب مدعي حقوق يتسترون وراء كتب مقدسة يقولون إنها تبرر لهم هذا الفساد وهذا العلو.\n" +
                    "\n" +
                    "أجل إنه الصراع الأبدي بين الحق والباطل، بين دعاة العدل والسلام للناس جميعا، وبين دعاة الحرب والظلم والعدوان. ومحله هو هذه الأرض ذات الطهر والقداسة والبركة، كما وصفها القرآن الكريم والحديث الشريف. فدورها في إظهار الحق، وكشف أهواء الباطل وتعريته، أيا كان دعاته، واضح. لذا كانت ولا زالت مأوى الأنبياء وأتباعهم الصادقين على مر العصور، والأرض التي لا يعمر فيها ظالم!\n" +
                    "\n" +
                    "وانطلاقا من هذه الطبيعة الخاصة، نتناول قصة المسجد الأقصى المبارك، والأرض المباركة من حوله، من خلال تقسيم تاريخه إلى 8 مراحل صعود وهبوط متتابعة، ترتبط بقوة أو ضعف الإيمان بالعقيدة لدى أتباع الرسل والأنبياء. وإننا إذ نعايش المرحلة الأخيرة من هذه المراحل الثمانية، وهي مرحلة هبوط يتعرض فيها بيت المقدس للاحتلال الصهيوني، فإننا نرنو إلى مرحلة مستقبلية تاسعة، مرحلة صعود ننتظرها ونتوقعها قريبا بإذن الله، جريا على سنن التاريخ مع هذه البقعة المباركة.\n"
        } else if (title.equals("جوامع ومصليات المسجد الاقصى")) {
            content_info.text = "الجامع القبلي\n" +
                    "الجامع القبلي، هو أهم جوامع المسجد الأقصى ويقع في جنوبه، وسمي بالجامع لأنه المصلى الرئيسي الذي يقف فيه خطيب صلاة الجمعة.\n" +
                    "\n" +
                    "يعود تاريخ بناء المسجد إلى عهد الخليفة المسلم عمر بن الخطاب، لكنّ بناءه بشكله الحالي وتجديده تم على يد الخليفة الأموي عبدالملك بن مروان  ، لكنّ زلزالاً عنيفاً دمره بعدها بعشرات الأعوام لتتم إعادة بنائه مرة أخرى في عهد الخليفة العباسي أبوجعفر المنصور.\n" +
                    "يبلغ طول الجامع نحو 80 متراً وعرضه نحو 55 متراً، وله 11 باباً، في حين يتميز بقبته الداخلية الخشبية التي تعلوها قبة خارجية مكسوة بالرصاص.\n" +
                    "\n" +
                    "ويعتبر الجامع القبلي من أكثر الأماكن المقدسة التي تتعرض للاعتداءات في القدس، أبرزها الحريق الذي حدث في 21 أغسطس/آب 1969 عندما اقتحم متطرف أسترالي يدعى دينيس مايكل روهان المسجد وقام بإشعال النار داخله، ما أدى إلى احتراق نحو ثلث الجامع، من بينها منبر نور الدين الزنكي  الذي أحضره صلاح الدين الأيوبي معه من حلب.\n مصلى الأقصى القديم\n" +
                    "في حين يقع مصلى الأقصى القديم أسفل الجامع القبلي، يتمّ الوصول إليه عن طريق درج حجري قرب الرواق الأوسط شمال الجامع القبلي.\n" +
                    "\n" +
                    "ويتألف المصلى من رواقين بُنيا في العهد الأموي أيضاً، ويؤديان في نهايتهما إلى \"الباب المزدوج\"، وهو أحد أبواب المسجد الأقصى المغلقة حالياً، ومن ثمّ باتجاه \"القصور الأموية\" الواقعة خارج أسوار المسجد من الناحية الجنوبية.\n" +
                    "\n" +
                    "ويتميز المصلى بأنه يحتوي على قبتين أمويتين فوق مدخله الجنوبي، بالإضافة إلى أعمدة حجرية ضخمة مدعومة بجسور خرسانية أضيفت إلى المكان خلال ترميمه في عام 1927.\n" +
                    "\n المصلى المرواني\n" +
                    "أما المصلى المرواني فيقع جنوب شرق حرم الأقصى ويتكون من 16 رواقاً حجرياً و11 باباً، فيما يتميّز بسقفه الكبير الذي يعتبر أكبر حجماً من سقف مسجد قبة الصخرة.\n" +
                    "\n" +
                    "بُني المصلى في الأساس من قِبَل الأمويين من أجل استخدامه كتسوية لهضبة بيت المقدس للبناء عليها، لكن الصليبيين قاموا لاحقاً بتحويله إلى إسطبل للخيول وسمّوه \"إسطبلات سليمان\"، لكن عند تحرير القدس أعاد صلاح الدين الأيوبي المكان إلى عهده السابق.\n" +
                    "\n" +
                    "أما سبب تسميته فكان تكريماً للخليفة الأموي مروان بن الحكم للدور الكبير الذي قام به مع أبنائه من بعده في إعادة إعمار المسجد الأقصى.\n" +
                    "\n مسجد البراق\n" +
                    "يقع مسجد البراق جنوب غرب المسجد الأقصى وتحديداً قرب باب المغاربة.\n" +
                    "\n" +
                    "سمّي المسجد بهذا الاسم؛ لأنه كان شاهداً على رحلة النبي محمد خلال ليلة الإسراء والمعراج الذي صعد على متن فرس أبيض يدعى \"البراق\".\n" +
                    "\n" +
                    "ووفقاً لمصادر أخرى، يقال إنّ سبب تسمية المسجد هو أنّ جبريل على السلام قام بربط البراق في حائط المسجد، ولا تزال إلى الآن الحلقة التي ربط فيها موجودة في الجدار.\n" +
                    "\n" +
                    "وللمسجد أهمية كبيرة لدى اليهود الذي يعتقدون أنه الأثر الوحيد المتبقي من \"هيكل سليمان\" الذي دمره نبوخذ نصر الثاني  .\n مسجد المغاربة\n" +
                    "أما مسجد المغاربة فيقع في الزاوية الجنوبية الغربية من المسجد الأقصى، وجنوب مسجد البراق، بناه صلاح الدين الأيوبي في عام 590 هجرية (1193 ميلادية)، حيث كانت تقام فيه الصلاة المالكية.\n" +
                    "\n" +
                    "يأخذ المسجد شكلاً مستطيلاً من الشمال إلى الجنوب وله بابان، باب مُغلق في الزاوية الشمالية، وآخر مفتوح من الجهة الشرقية.\n" +
                    "\n مسجد النساء\n" +
                    "يقع جامع النساء في الزاوية الجنوبية الغربية من المسجد الأقصى، ويقال إن تاريخ بنائه يعود إلى عهد الاحتلال الصليبي؛ إذ تمّ بناؤه على الأرجع ككنيسة قبل أن يحرر صلاح الدين الأيوبي القدس ويحوله إلى مسجد مخصص للنساء.\n" +
                    "\n" +
                    "يقسم مسجد النساء إلى 3 أقسام:\n" +
                    "\n" +
                    "القسم الأول: ملحق بالمتحف الإسلامي ويقع غرب المسجد.\n" +
                    "\n" +
                    "القسم الثاني: مكتبة الأقصى الإسلامية وتقع وسط المسجد.\n" +
                    "\n" +
                    "القسم الثالث: يستخدم كمستودع ويقع شرق المسجد.\n" +
                    "\n"
        }else if (title.equals("فضائل بيت المقدس وما حوله من السنة")){
            content_info.text = "أكد القرآن الكريم على مكانة القدس حيث ذكر في القران الكريم وخصه الله تعالى بمسرى خاتم المرسلين صلوات الله عليه من المسجد الحرام إلى المسجد الأقصى، وصلاته بالأنبياء فيه\n" +
                    "قال الله تعالى :\" سبحان الذي أسرى بعبده ليلاً من المسجد الحرام إلى المسجد الأقصى الذي باركنا حوله لنريه من آياتنا إنه هو السميع البصير\" الإسراء.\n" +
                    "سبب التسمية\n" +
                    "سُمِّي بالمسجد الأقصى لبعد ما بينه وبين المسجد الحرام، وكان أبعد مسجد عن أهل مكة في الأرض يعظم بالزيارة\n" +
                    "وللقدس مكانة خاصة في قلوب كل مسلم متمسك بعقيدته وتعاليم دينه لان القدس مدينة الأنبياء\n" +
                    "وهو مدينة الإسراء والمعراج وقبلة المسلمين الأولى وتتوق النفس لزيارته وتنسم رحيق النبوة فيه .\n" +
                    "\n" +
                    "\n" +
                    "\n" +
                    "فضائل بيت المقدس وما حوله في القرآن الكريم\n" +
                    "للقدس بركة خاصة به وبكل ما حوله والبركة المذكورة في الآية الكريمة في قوله تعالى \"الذي باركنا حوله\" إنما هي البركة الحسية والمعنوية .\n" +
                    "فأما الحسية فهي ما أنعم الله تعالى به على تلك البقاع من الثمار والزروع والأنهار.\n" +
                    "وأما المعنوية فهي ما اشتملت عليه من جوانب روحية ودينية، حيث كانت مهبط الصالحين والأنبياء والمرسلين\n" +
                    "ومسرى خاتم النبيين\n" +
                    "وقد دفن حول المسجد الأقصى كثير من الأنبياء والصالحين.\n" +
                    "\n" +
                    "\n" +
                    "وذكرت بركة الأراضي المقدسة في أكثر من موضع لأكثر من نبي\n" +
                    "قال تعالى:\" ونجيناه ولوطا إلى الأرض التي باركنا فيها للعالمين ( 71 ) ووهبنا له إسحاق ويعقوب نافلة وكلا جعلنا صالحين \"( 72 الأنبياء)\n" +
                    "وتروي الآيات حكاية عن الخليل إبراهيم عليه السلام في هجرته الأولى إلى بيت المقدس وبلاد الشام\n" +
                    "قال تعالى:\" وأورثنا القوم الذين كانوا يُستَضْعَفون مشارق الأرض ومغاربها التي باركنا فيها . ( الأعراف 137)\n" +
                    "وفي قصة سليمان عليه السلام\n" +
                    "يقول سبحانه وتعالى: ولسليمان الريح عاصفةً تجري بأمره إلى الأرض التي باركنا فيها \" الأنبياء\n" +
                    "وقال تعالى على لسان موسى :\" يا قوم ادخلوا الأرض المقدسة التي كتب الله لكم ولا ترتدوا على أدباركم فتنقلبوا خاسرين \" ( المائدة 21 )\n" +
                    "وعند حديث القرآن عن هناءة ورغد عيش أهل سبأ\n" +
                    "يقول سبحانه:\"وجعلنا بينهم وبين القرى التي باركنا فيها قرىً ظاهرةً \" سبأ\n" +
                    "وهي قرى بيت المقدس كما روى العوفي عن ابن عباس.\n" +
                    "وصف القرآن أرضها بالرَّبوة ذات الخصوبة وهي أحسن ما يكون فيه النبات، وماءها بالمعين الجاري.\n" +
                    "قال تعالى: \" وجلعنا ابنَ مريم وأمّه آيةً وآويناهما إلى ربوةٍ ذات قرارٍ ومعينٍ \" ( المؤمنون 50 )\n" +
                    "قال الضحاك وقتادة : وهو بيت المقدس.\n" +
                    "\n" +
                    "وهو القبلة التي كان يتوجه إليها الرسول صلى الله عليه وسلم والمسلمون قبل تحويلها إلى الكعبة، حيث صلى النبي صلى الله عليه وسلم نحو بيت المقدس بعد الهجرة ستة عشر شهراً أو سبعة عشر شهراً ثم حُوِّلت،\n" +
                    "وأشار القرآن إلى ذلك بقوله تعالى: \" وما جعلنا القبلة التي كنت عليها إلا لنعلم من يتبع الرسول ممن ينقلب على عقبيه وإن كانت لكبيرة إلا على الذين هدى الله وما كان الله ليضيع إيمانكم إن الله بالناس لرءوف رحيم \" البقرة\n" +
                    "وهو أرض المنادي من الملائكة نداء الصيحة لاجتماع الخلائق يوم القيامة\n" +
                    "كما قال سبحانه : \"واستمع يوم يُنادي المُنادِ من مكانٍ قريبٍ \". ق\n" +
                    "قيل : المكان القريب صخرة بيت المقدس ويقال : إنها وسط الأرض وأقرب الأرض من السماء باثني عشر ميلا .\n" +
                    "\n" +
                    "\n" +
                    "فضائل بيت المقدس وما حوله في السنة\n" +
                    "\n" +
                    "* فضل الصلاة فيه\n" +
                    "عن أبي ذر ، أنه سأل رسول الله صلى الله عليه وسلم عن الصلاة في بيت المقدس أفضل أو الصلاة في مسجد رسول الله صلى الله عليه وسلم ، فقال : « صلاة في مسجدي هذا أفضل من أربع صلوات فيه ، ولنعم المصلى في أرض المحشر والمنشر وليأتين على الناس زمان ولقيد سوط أو قال : قوس الرجل حيث يرى منه بيت المقدس خير له أو أحب إليه من الدنيا جميعاً» اللفظ للبيهقي وصححه الألباني.\n" +
                    "\n" +
                    "* أنها أرض المحشر والمنشر\n" +
                    "لما ورد أن مَيْمُونَةَ مَوْلاةِ النَّبِيِّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ\n" +
                    "قالت يا رسول الله أفتنا في بيت المقدس ؟\n" +
                    "قال : أرض المحشر والمنشر . ائتوه فصلوا فيه, فإن صلاة فيه كألف صلاة في غيره\n" +
                    "قلت : أرأيت إن لم أستطع أن أتحمل إليه ؟\n" +
                    "قال : فتهدي له زيتا يسرج فيه, فمن فعل ذلك فهو كمن أتاه .\" خلاصة الدرجة: صحيح - المحدث: الوادعي\n" +
                    "\n" +
                    "* البراق وبيت المقدس\n" +
                    "عن أنس رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: \" أتيت بالبراق فركبته حتى أتيت بيت المقدس فربـطـته بالحلقة التي يربط فيها الأنبياء ثم دخلت المسجد فصليت فيه ركعتين، ثم عـرج بي إلى السماء\" رواه مسلم .\n" +
                    "\n" +
                    "* لا يدخلها الدجال آخر الزمان\n" +
                    "عن جنادة بن أبي أمية الأزدي قال: \"ذهبت أنا ورجل من الأنصار إلى رجل من أصحاب النبي صلى الله عليه وسلم فقلنا حدثنا ما سمعت من رسول الله صلى الله عليه وسلم يذكر في الدجال، فذكر الحديث وفيه \"علامته يمكث في الأرض أربعين صباحا، يبلغ سلطانه كل منهل، لا يأتي أربعة مساجد: الكعبة ومسجد الرسول، والمسجد الأقصى والطور\" رواه أحمد .\n" +
                    "\n" +
                    "* ملاذ المؤمن\n" +
                    "عن ذي الأصابع رضي الله عنه قال: قلت يا رسول الله: إن ابتلينا بعدك بالبقاء أين تأمرنا؟ قال: \"عليك ببيت المقدس، فلعله ينشأ لك ذرية يغدون إلى ذاك المسجد ويروحون\"رواه أحمد .\n" +
                    "\n" +
                    "* الخلافة في بيت المقدس وعلامات الساعة\n" +
                    "عن أبي حوالة الأزدي رضي الله عنه قال: \" وضع رسول الله صلى الله عليه وسلم يده على رأسي أو على هامتي\n" +
                    "ثم قال: \"يا ابن حوالة: إذا رأيت الخلافة قد نزلت الأرض المقدسة، فقد دنت الزلازل والبلايا والأمور والعظام، والساعة يومئذ أقرب إلى الناس من يدي هذه من رأسك\" رواه أحمد وأبو داوود والحاكم .\n" +
                    "\n" +
                    "* أنها أحب إلى المسلم من الدنيا وما فيها\n" +
                    "لقوله صلى الله عليه وسلم: \".. ولنعم المصلى، وليوشكن أن يكون للرجل مثل سية قوسه (طرفي قوسه) من الأرض حيث يرى بيت المقدس خيرًا له من الدنيا وما فيها\" (الطبراني في الأوسط 8230, وقال الهيثمي في الزوائد 4/7: رجاله رجال الصحيح).\n" +
                    "\n" +
                    "* حرص الأنبياء والصالحين على زيارة المسجد الأقصى\n" +
                    "والصلاة فيه والسكن في بيت المقدس ومجاورة الأقصى, فقد زار بيت المقدس عمر بن الخطاب وأبو عبيدة وسعيد بن زيد وأم المؤمنين صفية وأبو الدرداء وسلمان الفارسي وعمرو بن العاص رضي الله عن الجميع\n" +
                    "\n" +
                    "* أمنية موسى عند موته\n" +
                    "لما نزلت الوفاة بموسى عليه الصلاة والسلام سأل الله أن يدنيه من الأرض المقدسة رمية بحجر,\n" +
                    "عن أبي هريرة رضي الله عنه قال \" أرسل ملك الموت إلى موسى عليه السلام فلما جاءه صكه فرجع إلى ربه فقال أرسلتني إلى عبد لا يريد الموت\n" +
                    "قال ارجع إليه فقل له يضع يده على متن ثور فله بما غطت يده بكل شعرة سنة\n" +
                    "قال أي رب : ثم ماذا ؟ قال : ثم الموت .قال : فالآن.\n" +
                    "قال : فسأل الله أن يدنيه من الأرض المقدسة رمية بحجر.\n" +
                    "قال أبو هريرة : فقال رسول الله صلى الله عليه وسلم : \" لو كنت ثم لأريتكم قبره إلى جانب الطريق تحت الكثيب الأحمر\" (البخاري, مسلم).\n" +
                    "\n" +
                    "* طائفة من أهلها على الحق ظاهرين إلى قيام الساعة\n" +
                    "لما روى أبو أمامة الباهلي, قال: قال رسول الله صلى الله عليه وسلم: \"لا تزال طائفة من أمتي على الدين ظاهرين لعدوهم قاهرين، لا يضرهم من خالفهم.. قالوا: فأين هم؟ قال: ببيت المقدس وأكناف بيت المقدس\" (رواه أحمد ).\n"
        }else if (title.equals("أروقة المسجد الأقصى المبارك")){
            content_info.text = "يحتوي المسجد الأقصى المبارك على 3 أروقة تاريخية تُضيف له منظر جمالي مميز، حيث تكون هذه الأروقة ملاصقة لأسوار المسجد من جهاته الثلاث الشرقية والشمالية والغربية. والرواق هو عبارة عن ممر طويل مسقوف بطريقة مميزة جداً، ويتكون من أعمدة حجرية موصولة بأقواس تاريخية تستخدم إما للدراسة أو التلاقي أو التشاور\n"
        }else if (title.equals("تاريخ المسجد الاقصى المبارك")){
            content_info.text = "أول بنائه\n" +
                    "لا يُعرف بشكل دقيق متى بُني المسجد الأقصى لأول مرة، ولكن ورد في أحاديث النبي محمد بأن بناءه كان بعد بناء الكعبة بأربعين عامًا، فعن أبي ذر أنه قال: «قلت: يا رسول الله! أي مسجد وضع في الأرض أول؟ قال: المسجد الحرام. قلت: ثم أي؟ قال: المسجد الأقصى. قلت: كم بينهما؟ قال: أربعون سنة».[10] وقد اختلف المؤرخون في مسألة الباني الأول للمسجد الأقصى على عدة أقوال: أنهم الملائكة، أو النبي آدم أبو البشر، أو ابنه شيث، أو سام بن نوح، أو النبي إبراهيم، ويرجع الاختلاف في ذلك إلى الاختلاف في الباني الأول للكعبة، وقد رجّح الباحث عبد الله معروف بأن آدم هو من بنى المسجد الأقصى البناء الأول، لرواية عن ابن عباس،[11] ولترجيح أن يكون آدم هو الباني للكعبة، كما رجّحه الإمام ابن حجر العسقلاني في كتابه فتح الباري.[12][13] ويُرجّح عبد الله معروف أن يكون البناء الأول للمسجد الأقصى قد اقتصر على وضع حدوده وتحديد مساحته التي تتراوح ما بين 142 و144 دونماً.[14]\n" +
                    "\n عهد اليبوسيين وبني إسرائيل\n أما من بعد عهد آدم، فقد انقطعت أخبار المسجد لانعدام التأريخ في تلك الفترة، إلى أن سُجلت معلومات تاريخية عن أول مجموعة من البشر قدمت إلى مدينة القدس وسكنتها، وهم اليبوسيون (3000 - 1550 ق.م) قبيلة كنعانية، وهم الذين بنوا مدينة القدس وأسموها \"اور شليم (مدينة السلام) ،[15] حتى أن بقايا الآثار اليبوسية ما تزال باقية في سور المسجد الأقصى بحسب رأي بعض الباحثين. وفي تلك الفترة، هاجر النبي إبراهيم إلى مدينة القدس، وعمّر المسجد وصلّى فيه، وكذلك ابنه إسحق وحفيده يعقوب من بعده.[14]\n" +
                    "\n" +
                    "وبعد ذلك آل أمر مدينة القدس والمسجد الأقصى إلى الفراعنة (1550 - 1000 ق.م)، ثم استولى عليها لاحقًا \"القوم العمالقة\"، ثم فتح المدينة النبي داود ومعه بنو إسرائيل عام 995 ق.م،[16] فَوُسْع المدينة وعمّر المسجد الأقصى. ثم استلم الحكم ابنه سليمان، فعمّر المسجد وجدّده مرة أخرى، ويروي النبي محمد ذلك فيقول: «لِمَا فرغ سُليمانُ بنُ داودَ عليهما اَلسَّلَام من بناءِ بيتِ المقدسِ سأل اللهَ عَزَّ وَجِلَ ثلاثًا أن يُؤتيَه حُكمًا يُصادِفُ حُكمَه ومُلكًا لا ينبغي لأحدٍ من بعدِه وَأَنَّهُ لا يأتي هذا المسجدَ أحدٌ لا يُريدُ إِلَّا اَلصَّلَاة فيه إلَّا خرج من ذنوبِه كيومِ ولدَتْه أُمّه» فقال النبي محمد: «أما اثنتيْن فقد أُعْطِيهما وأرجو أن يكونَ قد أُعْطِي اَلثَّالِثَة»،[17] وهذا البناء لسليمان هو الذي يقول اليهود بنسبته إليهم، ويطلقون عليه اسم \"هيكل سليمان\". وبوفاة النبي سليمان، انتهى حكم بني إسرائيل الذي دام 80 عامًا.[18]\n" +
                    "\n" +
                    "عهد الهياكل\n" +
                    "بعد وفاة سليمان، انقسمت دولة بني إسرائيل إلى \"مملكة إسرائيل\" في الشمال، و\"مملكة يهوذا\" في الجنوب ومعها القدس، وما لبثت أن هاجمها البابليون وأحرقوا الهيكل، وسبوا اليهود إلى بابل فيما عُرْف بالسبي البابلي.[19] بعد ذلك هزم الفرس البابليين، وسمح الملك الفارسي قورش الكبير عام 538 ق.م لمن أراد من أسرى اليهود في بابل بالعودة إلى القدس وإعادة بناء الهيكل المهدم،[20] فعاد عدد من اليهود إلى القدس وشرعوا في بناء الهيكل الثاني، وانتهوا من العمل به سنة 516 ق.م، في عهد الملك الفارسي دارا الأول، وعُرف فيما بعد بمعبد حيرود تيمنًا بملك اليهود حيرود الكبير الذي قام بتوسيعه.[21][22]\n" +
                    "\n" +
                    "عهد الرومان والبيزنطيين\n" +
                    "احتلّ الإغريق أراضي فلسطين، وخضعت للإسكندر المقدوني (حوالي عام 332 ق.م)، ثم لخلفائه البطالمة، ثم للسلوقيين، ولم تلبث المدينة حتى خضعت لحكم الإمبراطورية الرومانية، وكان من أوائل الحكام وأبرزهم الذين عينهم الرومان لحكم القدس الحاكم هيرودس (حوالي عام 37 ق.م)، وقد قام بتجديد بناء البيت المقدس (حوالي عام 20 ق.م)، كما أقام قلعة عظيمة بباب الخليل (يطلق عليها اليهود الآن اسم \"قلعة داود\").[19] وفي تلك الفترة تذكر المصادر الإسلامية بعثة النبي عيسى بن مريم، وزكريا وابنه يحيى بن زكريا إلى بني إسرائيل في القدس، حيث كان يحيى يعِظُهم داخل المسجد الأقصى، كما يفيد الحديث النبوي: «فجمع يحيى بن زكريا بني إسرائيل في بيت المقدس حتى امتلأ المسجد فقعد على الشرف فحمد الله وأثنى عليه ثم قال إن الله أمرني بخمس كلمات أن أعمل بهن وأمركم أن تعملوا بهن..»،[23] كما يذكر الإنجيل الذي بين أيدي النصارى اليوم أن عيسى بن مريم أنكر على بني إسرائيل انحرافهم عن عبادة الله تعالى داخل المسجد الأقصى، وتحويلهم إياه إلى مكان للبيع والشراء.[24]\n" +
                    "\n" +
                    "وبعد النبي عيسى بن مريم بحوالي 300 عام، انقسمت الإمبراطورية الرومانية إلى الإمبراطورية الرومانية الغربية في الغرب، والإمبراطورية البيزنطية في الشرق، وبقيت الإمبراطورية البيزنطية هي المُسيطرة على القدس، فأصبحت القدس مدينة نصرانية، وبنوا فيها كنيسة القيامة. أما المسجد الأقصى فبقي متروكًا كما هو دون بناء. وفي عام 614 احتل الفرس مدينة القدس بمعاونة اليهود، وذلك بعد حرب طويلة ضد البيزنطيين الروم، وقد وقع ذلك في الفترة التي بُعث فيها النبي محمد في مكة، إذ يذكر القرآن قصة الحروب في سورة الروم:  غُلِبَتِ الرُّومُ  فِي أَدْنَى الْأَرْضِ وَهُمْ مِنْ بَعْدِ غَلَبِهِمْ سَيَغْلِبُونَ) وما لبث أن عاد البيزنطيون الروم إلى الحكم عام 624، وفي تلك الفترة أصبحت أرض المسجد الأقصى مكبًا للنّفايات، وذلك انتقامًا من اليهود، إذ كانت الصخرة المُشرفة قبلة لهم.[25]\n" +
                    "\n عهد النبي محمد\n كانت هناك أهميّة خاصة للمسجد الأقصى في عهد النبي محمد، إذ كان القبلة الأولى للمسلمين بعد هجرة النبي محمد إلى المدينة المنورة عام 1 هـ الموافق 622م، فقد كان المسلمون يتوجّهون إلى المسجد الأقصى في صلواتهم، ومكثوا على ذلك مدة 16 شهرًا تقريبًا.[26] فقد روى البراء بن عازب أنه قال: «لما قَدِمَ النَّبيُ صلى الله عليه وسلم المدينةَ صلّى نَحوَ بيتِ المقدسِ سِتةَ عَشرَ شهرًا أو سبعةَ عَشرَ شهرًا، وكان يُحبُ أنْ يُوَجِّهِ إلى الكَعبةِ، فأنزل اللّه تعالى  قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاءِ فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُ مَا كُنْتُمْ فَوَلُّوا وُجُوهَكُمْ شَطْرَهُ وَإِنَّ الَّذِينَ أُوتُوا الْكِتَابَ لَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِنْ رَبِّهِمْ وَمَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ\n" +
                    "\n وكان المسجد الأقصى وجهة النبي محمد في الرحلة المعجزة المعروفة باسم الإسراء والمعراج، وذلك ليلة 27 رجب بعد البعثة بعشر سنين (3 ق هـ)،[29] إذ يؤمن المسلمون أن النبيَّ محمدًا خرج من المسجد الحرام بصحبة المَلَك جبريل راكبًا دابّة البراق، فنزل في المسجد الأقصى وربط البُراق بحلقة باب المسجد عند حائط البراق، وصلّى بجميع الأنبياء إمامًا،[30] ثم عُرج به من الصخرة المشرّفة إلى فوق سبع سماوات مارًا بالأنبياء: آدم ويحيى بن زكريا وعيسى بن مريم ويوسف وإدريس وهارون وموسى وإبراهيم.[31]\n" +
                    "\n عندما تولّى الخليفة أبو بكر الصديق خلافة المسلمين خلفاً للنبي محمد، قام بتسيير جيش أسامة بن زيد لفتح بلاد الشام عامّة ونشر الدعوة الإسلامية فيها، وقد كان النبي محمد قد جهّز جيش أسامة قبل وفاته، وما لبث أن تُوفي أبو بكر الصديق، فتولّى عمر بن الخطاب الخلافة، فكان أوّل ما فعله أن ولّى أبا عبيدة بن الجراح قيادة الجيش الفاتح لبلاد الشام بدلاً من خالد بن الوليد، فوصل أبو عبيدة بن الجراح إلى مدينة القدس (وكانت تُسمى \"إيلياء\")، فاستعصت عليهم ولم يتمكنوا من فتحها لمناعة أسوارها، حيث اعتصم أهلها داخل الأسوار، فحاصرهم حتى تعبوا وأرسلوا يطلبون الصلحَ وتسليم المدينة بلا قتال، واشترطوا أن يأتي خليفة المسلمين بنفسه إلى القدس ليتسلّم مفاتيحها منهم، فخرج عمر بن الخطاب من المدينة المنورة حتى وصل القدس، وذلك عام 15 هـ الموافق 636م، وأعطى أهلها الأمن وكتب لهم العهدة العمرية. وقد صحبه البطريرك \"صفرونيوس\" فزار كنيسة القيامة، ومن ثم أوصله إلى المسجد الأقصى، فلمّا دخله قال: «الله أكبر، هذا المسجد الذي وصفه لنا رسول الله صلى الله عليه وسلم»، وكان في تلك الأيام عبارة عن هضبة خالية في قلبها الصخرة المشرفة، ثم أمر الخليفة عمر بن الخطاب ببناء المصلّى الرئيسي الذي سيكون مكان الصلاة الرئيسي في المسجد الأقصى، وهو موقع \"الجامع القبلي\" اليوم، ويقع في الجنوب في جهة القبلة، وكان المسجد في عهده عبارة عن مسجد خشبي يتّسع لحوالي 1000 شخص، وبقي على حاله إلى زمن الخليفة الأموي معاوية بن أبي سفيان.[32]\n" +
                    "\n العهد الأموي\n" +
                    "بعد قيام الدولة الأموية في عام 41 هـ الموافق 661 على يد معاوية بن أبي سفيان، قام بتجديد بناء المسجد القبلي داخل المسجد الأقصى الذي بناه عمر بن الخطاب،[33] فجعل من الحجر بدلاً من الخشب، ووسّعه ليسع 3000 مصلٍ.[33] وقد ذكر بعض المؤرخين المسلمين في مذكراتهم مثل مجير الدين والمقدسي والسيوطي أن أوسع حركة تعمير للمسجد تمت في عهد الخليفة عبد الملك بن مروان منذ عام 65 هـ الموافق 685 جنبا إلى جنب مع قبة الصخرة،[33][34] وتواصلت في عهد ابنه الوليد بن عبد الملك حتى عام 96 هـ الموافق 715. حيث بدأ البناء الأموي للمسجد الأقصى ببناء قبة الصخرة وهي عبارة عن قبة ذهبية فوق الصخرة المشرفة الواقعة في قلب الأقصى (في منتصف المسجد أقرب إلى الغرب قليلا)، والتي تمثل أعلى نقطة في جبل البيت المقدس، ويعتقد أن معراج النبي محمد إلى السماء تم منها، لتكون قبة للمسجد كاملاً. وقبل الشروع ببنائها، أقيمت بجانبها قبة صغيرة في منتصف المسجد الأقصى تماماً، عُرفت بـ \"قبة السلسلة\"، لتكون مقراً للمشرفين على البناء للأقصى، وخزانة لجمع الأموال اللازمة لذلك، وقيل لتكون نموذجاً لقبة الصخرة.\n" +
                    "\n الزلزال وإعادة البناء\n" +
                    "في عام 746، تعرض المسجد الأقصى إلى زلزال أدى إلى تدميره، وبعد أربع سنوات أطاح السفاح بالخلافة الأموية، وأنشأ الخلافة العباسية عام 750م. وبعد أربع سنوات توفي السفاح بعد أن عهد بالخلافة لأخيه أبو جعفر المنصور، وقد أعلن المنصور نيته لإصلاح المسجد، وقال أنه لويحات الذهب والفضة التي غطت بوابات المسجد يجب إزالتها وتحولت إلى دينار ودرهم لتمويل إعادة الإعمار التي انتهت في عام 771. وفي عام 774، ضرب زلزال ثاني المسجد أدى إلى تدمير معظم إصلاحات المنصور، باستثناء تلك التي في الجزء الجنوبي من المسجد.[34][35] وفي عام 780، أعيد بناء المسجد في عهد الخليفة محمد المهدي الذي أمر ببنائه فانقص من طوله وزيد في عرضه [34][36][37] وفي عام 985، أشار الجغرافي المقدسي أن المسجد الذي تم تجديده كان يضم \" خمسة عشر رواق وخمسة عشر باب\".[35]\n" +
                    "\n الحملة الصّليبيّة\n" +
                    "في عام 1099م، سيطر الصليبيون على القدس، أثناء الحملة الصليبية الأولى. وبدلا من تدمير المسجد أطلقوا عليه اسم معبد سليمان، وقد استخدمه الصليبيون أولًا كقصر ملكي وإسطبل للخيول. وفي عام 1119م، تم تحويله إلى مقر لفرسان الهيكل. وخلال هذه الفترة، خضع المسجد إلى بعض التغييرات الهيكلية، بما في ذلك توسيع الشرفة الشمالية، وإضافة حنية (محراب الكنيسة) وجدار فاصل. وقد تم بناء دير جديد وكنيسة أيضا في الموقع، جنبا إلى جنب مع غيرها من الهياكل المختلفة [41] وقد شيد فرسان المعبد أقباء ومرفقاتها في الجهة الغربية والشرقية للمبنى؛. ويستعمل القبو الغربي حاليا كمسجد للنساء أما الشرقي فيستخدم كمتحف إسلامي.[35]\n" +
                    "\n" +
                    "بعد حصار 1187 استطاع صلاح الدين الأيوبي باستعادة القدس من يد الصليبيين، وأجريت العديد من الإصلاحات والتجديدات في المسجد الأقصى. من أجل إعداد المسجد لأداء صلاة الجمعة، وفي غضون أسبوع من استعادة صلاح الدين للقدس تم إزالة المراحيض ومخازن الحبوب المثبتة من قبل الصليبيين في الأقصى، وقد تم أيضا إزالة الأرضيات المغطاة بالسجاد الثمين، وباطنها المعطر بماء الورد والبخور، [42] وقد كلف نور الدين الزنكي، ببناء منبر جديد مصنوع من العاج والخشب في 1168-1169، ولكن تم الانتهاء منه بعد وفاته، وقد قام صلاح الدين بإضافة منبر نور الدين زنكي إلى المسجد في نوفمبر 1187،[43] وفي عام 1218م، تم تشييد الرواق الشمالي للمسجد مع ثلاث بوابات في عهد المعظم السلطان الأيوبي لدمشق، وفي عام 1345م، تم إضافة أضاف اثنين من البلاطات وبوابتين على الجانب الشرقي للمسجد، بأمر من السلطان المملوكي الكامل سيف الدين شعبان ابن قلاوون.[35]\n" +
                    "\n" +
                    "وبعد وصول العثمانيين إلى السلطة في 1517، لم يقوموا بأي تجديدات أو إصلاحات للمسجد نفسه، لكن قاموا ببعض الإضافات للحرم الشريف ككل. وشمل ذلك بناء نافورة قاسم باشا عام (1527)، وتم ترميم بركة من رارانج، وبناء ثلاث قباب قائمة بذاتها، وأبرزها قبة النبي التي بنيت في عام 1538.[44] وقد اهتم الولاة العثمانيين في القدس بالمسجد كثيرا وجعلوه في مقدمة أولياتهم[44]\n" +
                    "\n العصر الحديث\n التجديد الأول للمسجد الأقصى في القرن العشرين حدث في عام 1922، عندما كلف المجلس الإسلامي الأعلى تحت أمين الحسيني (مفتي القدس الكبرى) المهندس المعماري التركي أحمد كيماليتين استعادة المسجد الأقصى والمعالم الآثرية في ساحاته. كما أن المجلس أيضا قام بتكليف المهندسين المعماريين البريطانيين وخبراء مصريين والمسؤولين المحليين للمساهمة والإشراف على الإصلاحات والإضافات التي نفذها كيماليتين مابين 1924–1925. وقد شملت التجديدات تعزيز الأسس الأموية القديمة للمسجد، وتصحيح الأعمدة الداخلية، لتحل محل العوارض ونصب السقالات، وشملت أيضا التجديدات ترميم الأقواس والمنطقة الداخلية للقبة الرئيسية وكيفية الحفاظ عليها، وقد تم إعادة بناء الجدار الجنوبي، واستبدال الأخشاب في الصحن المركزي مع بكتلة من الخرسانة. وكشفت التجديدات أيضا عن فسيفساء تعود إلى العصر الفاطمي، وأيضا أكتشف وجود نقوش على الأقواس الداخلية التي كانت مغطاة بالجبس. وقد زينت الأقواس بالذهب والجص الأخضر ملون واستبدلت الأخشاب بالنحاس.[45] وجدد ربع نوافذ الزجاج المعشق أيضا بعناية شديدة حفاظا على تصاميمهم العباسية والفاطمية الأصلية، وقد تعرض المسجد الأقصى لأضرار شديدة بسبب وقوع زلازل مابين 1927 و1937، وقد تم إصلاح الأضرار التي لحقت بالمسجد في عام 1938 و1942.[35]\n" +
                    "\n حريق المسجد\n تعرض في صبيحة يوم الخميس الموافق 22 أغسطس 1969م لحريق على يد يهودي أسترالي متطرف اسمه مايكل دينس روهن،[46] حيث تم حرق الجامع القبلي الذي سقط سقف قسمه الشرقي بالكامل،[43] كما احترق منبر صلاح الدين،[43] الذي أمر ببنائه نور الدين زنكي قبل تحرير المسجد الأقصى من الصليبيين وقام (صلاح الدين الأيوبي) بوضعه داخل المسجد بعد التحرير،[43] وقد قال روهن تعقيبا على الحريق الذي إفتعله أنه كان يأمل من إحراق المسجد الأقصى كان من شأنه أن يعجل المجيء الثاني للمسيح، مما يجعل الطريق لاعادة بناء الهيكل اليهودي المزعوم على جبل الهيكل .[47] وأدخل روهن إلى مصحة الأمراض العقلية، وردا على الحادث، تم عقد قمة للدول الإسلامية في الرباط في العام نفسه، الذي استضافه الملك فيصل. ويعتبر حريق الأقصى أحد العوامل المحفزة لتشكيل منظمة المؤتمر الإسلامي (والآن منظمة التعاون الإسلامي)، وفي عام 1972 ، تم ترميم المسجد الأقصى والمنبر معه، وتتولى الأردن ترميم وإصلاح المسجدين على نفقتها الخاصة كلما دعا الأمر لذلك.[48]\n" +
                    "\n في الثمانينات من القرن الماضي، تآمر بن شوشان ويهودا اتزيون وكلاهما عضو في منظمة غوش امونيم السرية، لتفجير المسجد الأقصى وقبة الصخرة. أما اتزيون فقد كان يعتقد أن تفجير اثنين من المساجد سوف يتسبب بصحوة روحية في الكيان الصهيوني، وسوف يحل جميع مشاكل اليهود. كما أعرب كل من بن شونان واتزينون عن أملهم في بناء المعبد الثالث في القدس وتحديداً في موقع المسجد الأقصى.[49][50] وفي 15 يناير 1988، خلال الانتفاضة الأولى، أطلقت القوات الصهيونية الرصاص المطاطي والغاز المسيل للدموع على المتظاهرين خارج المسجد، مما أدى إلى إصابة 40 من المصلين.[51][52] وفي 8 أكتوبر 1990، قتل 22 فلسطينياً وأصيب أكثر من 100 آخرين من \"شرطة الحدود الصهيونية\" خلال الاحتجاجات التي تم تشغيلها بواسطة الإعلان عن \"جبل الهيكل\"، على يد مجموعة من اليهود المتدينين، الذين كانوا في طريقهم لوضع حجر الأساس للهيكل الثالث المزعوم.[53][54]\n" +
                    "\n منع الصلاة في المسجد سنة 2017\n في يوم الجمعة 20 شوال 1438هـ الموافق فيه 14 يوليو 2017م، قالت الشرطة الإسرائيلية إنها قررت منع صلاة الجمعة في المسجد الأقصى لهذا اليوم وإغلاق أبوابه حتى إشعار آخر، وذلك في أعقاب عملية إطلاق نار وقعت صباح نفس اليوم المذكور أفضت إلى استشهاد ثلاثة شبان فلسطينيين وقتل ثلاثة من أفراد الشرطة الإسرائيلية بالقرب من باب الأسباط بالقدس. ونشرت الشرطة المذكورة تصريح مكتوب قالت فيه أن قائدها العام في القدس «يهورام هاليفي» قرر إغلاق أبواب المسجد، وإعلانه منطقة عسكرية يمنع بموجبها على المصلين دخوله إضافة إلى البلدة القديمة في القدس، لتكون تلك المرة الأولى التي تقفل فيها أبواب المسجد أمام المصلين منذ سنة 1969م، وذلك في اليوم التالي لإقدام اليهودي المتطرف مايكل دينس روهن على محاولة إحراق المسجد. بِالمُقابل قال مكتب رئيس الوزراء الإسرائيلي بنيامين نتنياهو إن الإغلاق هو ليوم واحد فقط.[62][63] وعندما أُعلن هذا الأمر، دعا المفتي العام للقدس والديار الفلسطينية الشيخ محمد حسين إلى شد الرحال للأقصى والتواجد على الحواجز وفي الساحات لإقامة صلاة الجمعة، وقال أن «لا قوة على وجه الأرض ستمنعهم من التوجه للأقصى وإقامة صلاة الجمعة فيه».[63] بالمقابل شرعت منظمات وأحزاب يهودية بحملة تحريض واسعة بحق المسجد الأقصى والمصلين، عقب عملية إطلاق النار سالِفة الذِكر، وقال عضو الكنيست من حزب البيت اليهودي «موتي يوغاف» إلى إغلاق المسجد الأقصى بوجه المسلمين لفترة دائمة، وقالت منظمة جبل الهيكل إلى الرد على عملية القدس عبر زيادة بناء المستوطنات اليهودية وزيادة ساعات الاقتحام للأقصى،[63] كما قال نائب وزير الجيش الإسرائيلي، الحاخام إيلي بن دهان، إنه يجب على اليهود أن يعززوا قبضتهم على المسجد الأقصى، وضمان أن يصلي كل يهودي فيه بأمان وفي كل وقت.[64]\n" +
                    "\n وفي يوم 22 شوال 1438هـ الموافق فيه 16 يوليو 2017م، نصبت السُلطات الإسرائيلية بوَّابات تفتيش إلكترونيَّة على عدد من أبواب الأقصى في سبيل تعزيز إجراءاتها الأمنيَّة، بِالإضافة إلى كاميرات مُراقبة لِلاطلاع على ما يجري داخل باحات المسجد. ثُمَّ أعلن وزير الأمن الداخلي الإسرائيلي جلعاد أردان افتتاح بابيّ الأسباط والمجلس المُؤديان إلى المسجد، لكنَّهُ في نفس الوقت قال أنَّ «إسرائيل هي صاحبة السيادة في المسجد، وموقف الدُول الأُخرى ليس مهماً» وأنَّ «إسرائيل إذا قررت فعل شيء في القدس ستُنفذه». وقد رفض موظفو الأوقاف الإسلاميَّة الدُخول إلى المسجد ومُباشرة أعمالهم احتجاجًا على هذه الخطوة الإسرائيليَّة. أيضًا رفض عامَّة الناس الانصياع للإجراءات الإسرائيليَّة ورفضوا دخول المسجد عبر هذه البوابات، وتجمهروا أمام باب الأسباط لِأداء الصلاة، وأعلنوا الاعتصام لِلحيلولة دون تحويل وضع المسجد الأقصى إلى ما يشبه الوضع القائم في المسجد الإبراهيمي بالخليل والإبقاء على البوابات الإلكترونية بشكلٍ دائم.[65] استمرَّ الوضع قائمًا على هذه الحال بضعة أيَّام، فتظاهر المقدسيُّون وتابعوا اعتصامهم أمام أبواب المسجد الأقصى، وتخلل ذلك بعض الاشتباكات مع الشرطة الإسرائيليَّة، وفي يوم 4 ذي القعدة 1438هـ الموافق فيه 27 يوليو 2017م أعلنت الشرطة الإسرائيلية إزالة كل الإجراءات الأمنية التي استحدثتها وعودة الوضع إلى ما كان عليه قبل وقوع الهُجوم الذي أدى إلى مقتل ثلاثة من أفراد الشرطة، فعمَّت الاحتفالات مدينة القدس ابتهاجًا بفتح أبواب المسجد الأقصى، وأقيمت الصلوات في مواعيدها المعتادة بداخل الحرم يومذاك.[66] وبعد إعادة افتتاح المسجد ببضعة أيَّام، وتحديدًا يوم 8 ذي القعدة 1438هـ، كشف رئيس مركز القدس الدولي حسن خاطر، أن السلطات الإسرائيلية صادرت وثائق مهمة كانت محفوظة بداخله، تتعلق بأملاك وأوقاف القدس وأراضيها، وذلك أثناء فترة إغلاقه أمام المسلمين. وحذَّر من كارثة كبيرة تحوم حول الحرم القدسي نظرًا لأن إسرائيل تمهد للتلاعب بالوثائق التي استولت عليها بهدف إلحاق الضرر بالأوقاف، التي تشكل أملاكها ما نسبته 90% من البلدة القديمة، مقسمة بين عقارات وأراضٍ ووقف إسلامي. بعد هذا الاكتشاف، شكَّلت دائرة الأوقاف الإسلامية بالقدس لجنة فنية لحصر حجم المفقودات من الوثائق المسروقة للتحرك ضد إسرائيل.[67]\n" +
                    "\n"
        }
    }

}